INSERT INTO hourly_wages (name, hourly_wage) VALUES 
('山川実羅乃', 1000),
('九野圭佑', 1100),
('AI JINGYI', 1200),
('増田帆伽', 1400),
('磯辺玲菜', 1000);

INSERT INTO attendances (name_id, checkin_time, checkout_time, date) VALUES 
(1, '09:03:00', '17:00:00', '2025-01-15'),
(2, '08:30:00', '17:30:00', '2025-01-15'),
(3, '09:15:00', '18:15:00', '2025-01-15'),
(4, '09:30:00', '17:45:00', '2025-01-15'),
(5, '09:00:00', NULL, '2025-01-15'),
(1, '09:00:00', '18:00:00', '2025-01-14'),
(2, '08:30:00', '17:30:00', '2025-01-14'),
(3, '09:10:00', '18:10:00', '2025-01-14');

  
INSERT INTO stamps (name_id, pre_checkin_time, pre_checkout_time, comment) VALUES 
(1, '08:55:00', '17:00:00', '電車遅延のため出勤時刻を変更申請'),
(2, '08:30:00', '14:00:00', '早退の申請'),
(3, '09:00:00', '19:00:00', '残業時間の修正申請'),
(4, '09:30:00', '15:30:00', '体調不良のため、早退しました'),
(5, '09:00:00', '17:00:00', '打刻が忘れました');

